In [21]:
%%HTML
<style type="text/css">
    table.dataframe td, table.dataframe th {
    border: 1px  black solid !important;
    color: black !important;
    }
</style>

In [51]:
#download from github:
#https://download-directory.github.io/?url=https%3A%2F%2Fgithub.com%2Fcodebasics%2Fpy%2Ftree%2Fmaster%2FML%2F1_linear_reg%2FExercise
import pandas as pd
import numpy as np
from sklearn import linear_model

# convert num-words to num-digit,: `pip install word2number`
from word2number import w2n

#data:
url = "https://raw.githubusercontent.com/codebasics/py/master/ML/2_linear_reg_multivariate/Exercise/hiring.csv"

In [49]:
df = pd.read_csv('hiring.csv', index_col=[0])
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [52]:
#fill 'zero' to 'NaN' in 'experience' col
df.experience = df.experience.fillna('zero')

In [53]:
df.head(5)

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [54]:
#convert num-words to num-digit
df.experience = df.experience.apply(w2n.word_to_num)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [59]:
# we see NaN in test_score col, convert that to median value
mean_test_score = math.floor(df['test_score(out of 10)'].mean())
mean_test_score

7

In [60]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(mean_test_score)

In [57]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [64]:
# regressor model
reg = linear_model.LinearRegression()
reg.fit(df[['experience','test_score(out of 10)','interview_score(out of 10)']], df['salary($)'])

LinearRegression()

In [66]:
#(1) salary prediction for `experince = 2`, `test_score = 9` and `interview_score = 6`
reg.predict([[2,9,6]])

array([53713.86677124])

In [67]:
#(2) salary prediction for `experince = 12`, `test_score = 10` and `interview_score = 10`
reg.predict([[12,10,10]])

array([93747.79628651])

In [ ]:
#If we compare above two values, we can see the difference how independent variables ()